[
    {
        "id": "THANATOS",
        "name": "Thanatos",
        "canFly": true,
        "stats": {
            "HP": 125,
            "STR": 12,
            "MAG": 20,
            "WIS": 19
        },
        "passive": {
            "name": "Embrace of Death",
            "text": "You are not chaos, you are silence. Struggle only hastens the stillness.\" Any enemy reduced below 40 HP by Thanatos is instantly defeated. Immune to fear, sleep, and time-based magic. Thanatos cannot be healed by others — only regains HP when an enemy is defeated (+25 HP)."
        },
        "abilities": [
            {
                "id": "THANATOS_-_THE_SILENT_END_AB1",
                "name": "Soul Bind",
                "power": 10,
                "type": "physical",
                "text": "Threads fray, lives unravel. None escape the hand that waits at the end.\"\n Entangles opponents with deathly chains. Effect: Stuns enemy for 1 turn."
            },
            {
                "id": "THANATOS_-_THE_SILENT_END_AB2",
                "name": "Corrupt Demise",
                "power": 12,
                "type": "physical",
                "text": "Those who defy the order of death are bound. Your chains never falter.\"\n Turns the enemy into a corrupted soul, assisting Thanatos in battle. Effect: If this attack eliminates an enemy, summons a corrupted soul with 40HP and 15 ATK to target the opponent with the least HP."
            },
            {
                "id": "THANATOS_-_THE_SILENT_END_AB3",
                "name": "Silent Finality",
                "power": 20,
                "type": "physical",
                "text": "Your touch brings silence, a peaceful end disguised as mercy.\"\n Thanatos brings upon the inevitable fate of death. Effect: If this attack eliminates an enemy, they cannot be revived this session. Lore: Not cruel, not vengeful. Thanatos does not chase. He does not rage. He waits. When the last breath fades, he is there, silent wings unfurling, guiding mortals to the gate that never opens twice. Voicelines:"
            }
        ]
    },
    {
        "id": "ZEUS",
        "name": "Zeus",
        "canFly": true,
        "stats": {
            "HP": 140,
            "STR": 14,
            "MAG": 20,
            "WIS": 17
        },
        "passive": {
            "name": "s - Panhellenios’ Rule",
            "text": "Zeus can set a weather hazard (Thunderstorm) in which all flying characters except for Zeus, regardless of enemy or ally, will take 8 HP damage and grounded enemies will take 4 HP damage at the end of the round for the whole challenge. First Judgement: Zeus goes first regardless how high his roll is. Can only be used once per challenge All enemy Olympians are affected by his Authority in which Zeus can do a Magic Power check. If the Olympian has less than 19 Magic Power, they must forfeit their action"
        },
        "abilities": [
            {
                "id": "ZEUS_AB1",
                "name": "Arcing Bolt",
                "power": 14,
                "type": "magical",
                "text": "Effect: Stuns the target for their turn."
            },
            {
                "id": "ZEUS_AB2",
                "name": "Thundering Fury",
                "power": 15,
                "type": "magical",
                "text": "Effect: If the first hit lands, the rest cannot be dodged."
            },
            {
                "id": "ZEUS_AB3",
                "name": "Titanstorm",
                "power": 19,
                "type": "magical",
                "text": "Effect: Stun for 1 turn + All enemies lose 3 HP at the start of their next 2 turns due to lingering shock. Effect: Zeus gets a -3 in his accuracy when using this move, but in return if the move hits, he goes first the next round."
            }
        ]
    },
    {
        "id": "LETHE",
        "name": "Lethe",
        "canFly": false,
        "stats": {
            "HP": 130,
            "STR": 6,
            "MAG": 19,
            "WIS": 18
        },
        "passive": {
            "name": "Waters of Forgetting",
            "text": "Enemies who fail a Wisdom challenge against Lethe forget one of their abilities for the next round. Immune to all memory or illusion effects. Twice per session, Lethe may remove a negative condition (e.g., burn, poison) from an ally by “washing” them in her river magic."
        },
        "abilities": [
            {
                "id": "LETHE_AB1",
                "name": "Memory Fade",
                "power": 10,
                "type": "physical",
                "text": "Effect: Target skips their action"
            },
            {
                "id": "LETHE_AB2",
                "name": "River Mist",
                "power": 13,
                "type": "magical",
                "text": "Effect: All enemies suffer -4 to their roll"
            },
            {
                "id": "LETHE_AB3",
                "name": "Oblivion Surge",
                "power": 18,
                "type": "magical",
                "text": "Effect: Target forgets their strongest attack for 2 rounds and suffers minor psychic damage (extra 4 HP lost for 2 rounds)."
            }
        ]
    },
    {
        "id": "EUPHROSYNE",
        "name": "Euphrosyne",
        "canFly": false,
        "stats": {
            "HP": 125,
            "STR": 7,
            "MAG": 18,
            "WIS": 16
        },
        "passive": {
            "name": "Aura of Delight",
            "text": "Allies within the same challenge automatically recover +2 HP at the start of their turn. Immune to fear, sadness, or mind-altering debuffs related to despair. Once per session, Euphrosyne may cancel one negative emotional status (fear, confusion, etc.) for all allies."
        },
        "abilities": [
            {
                "id": "EUPHROSYNE_AB1",
                "name": "Joyful Burst",
                "power": 9,
                "type": "magical",
                "text": "Effect: One ally regains +6 HP and gains +1 to their next roll."
            },
            {
                "id": "EUPHROSYNE_AB2",
                "name": "Gleam of Grace",
                "power": 10,
                "type": "physical",
                "text": "Effect: All allies take -3 less damage from the next incoming attack"
            },
            {
                "id": "EUPHROSYNE_AB3",
                "name": "Dance of Laughter",
                "power": 17,
                "type": "physical",
                "text": "Effect: One enemy skips their next special ability due to overwhelming confusion."
            }
        ]
    },
    {
        "id": "HARPOCRATES",
        "name": "Harpocrates",
        "canFly": false,
        "stats": {
            "HP": 125,
            "STR": 8,
            "MAG": 17,
            "WIS": 18
        },
        "passive": {
            "name": "Veil of Silence",
            "text": "Immune to all noise-based or mind-control attacks. Has a shield that if an enemy attacks Harporcrates, it silences them for 2 rounds and regenerates every other round Gains one reroll or extra clue when solving puzzles, riddles, or logic-based traps."
        },
        "abilities": [
            {
                "id": "HARPOCRATES_AB1",
                "name": "Silent Command",
                "power": 7,
                "type": "physical",
                "text": "Effect: Target is silenced for 2 turn and cannot use physical or verbal abilities."
            },
            {
                "id": "HARPOCRATES_AB2",
                "name": "Whisper of Doubt",
                "power": 10,
                "type": "physical",
                "text": "Effect: Target rerolls their next action and must keep the lower result."
            },
            {
                "id": "HARPOCRATES_AB3",
                "name": "Shroud of Secrets",
                "power": 14,
                "type": "physical",
                "text": "Effect: All enemies in range suffer -3 to HP for 2 rounds and suppresses the target. (Supress can bypass CC immunity.)"
            }
        ]
    },
    {
        "id": "CHARON",
        "name": "Charon",
        "canFly": false,
        "stats": {
            "HP": 135,
            "STR": 5,
            "MAG": 8,
            "WIS": 18
        },
        "passive": {
            "name": "The Apathetic Ferryman",
            "text": "Immune to fear, curse, and paralysis effects. Due to his apathetic nature Charon does not deal any damage with his moves. His indifferent silence provokes enemies. This causes them to be taunted whenever Charon casts a move (only takes effect on enemies who play after Charon). Enemies can escape the taunt by rolling a wisdom check (18 + 10 = 28) Any enemy who tries to flee or disengage from Charon must pass a wisdom check. Once per session, Charon may instantly drag an ally or enemy to safety (ally) or out of the field (enemy), removing them from the current round. (If Charon removes an ally cleanse all debuffs from that ally.)"
        },
        "abilities": [
            {
                "id": "CHARON_AB1",
                "name": "Souls in Limbo",
                "power": 0,
                "type": "physical",
                "text": "Effect: Summons 2 undead souls with 20 HP each that taunt all enemies. Enemies must pass a wisdom check (20) to not be affected by the taunt. If the undead soul/s survive the turn they attack a random enemy for 10 damage."
            },
            {
                "id": "CHARON_AB2",
                "name": "Coin of Passage",
                "power": 0,
                "type": "physical",
                "text": "Effect: If the coin lands on heads Charon takes 10 less damage for every attack he takes during that turn and heals allies including himself for 10 HP. If it lands on tails all enemies take 10 more damage for every attack they take during that turn and deal 5 less damage."
            },
            {
                "id": "CHARON_AB3",
                "name": "Domain Expansion: Gate of the Underworld",
                "power": 0,
                "type": "physical",
                "text": "Domain: Charon summons the river of Styx in the domain which separates the ground into two sides. Enemies and allies are separated. People can only use moves on people they are on the same side with. In order to cross the river people must use their coins given by the sure hit effect. However Charon can switch between sides freely. (You can only cross sides at the start of your turn) Domain Sure Hit Effect: (River of Styx): All people within the domain are given 2 coins to use. Effect: During the domain all of Charon’s moves are buffed. Souls in Limbo: Summons 3 souls with 30 HP each. Their wisdom check threshold is increased to 25 and they deal 15 damage to a random enemy if they survive the turn. Coin of passage: Charon now flips 2 coins. The effects of each side are also buffed. (Effects stack when rolled twice) Heads: Charon gets -15 damage reduction and heals allies including himself for. 15 HP. Tails: Enemies take +15 more damage and deal 10 less damage. Effect: Enemies that are brought within the domain must flip a coin (obol). If it lands on tails they will get a -10 power debuff for all attacks on during that turn. If it lands on head there will be no effect. Allies (excluding Charon) within the domain will also flip a coin. If it lands on heads they will gain a +10 power buff for all attacks during that turn. If it lands on tails they gain nothing."
            }
        ]
    },
    {
        "id": "MIDAS",
        "name": "Midas",
        "canFly": false,
        "stats": {
            "HP": 125,
            "STR": 10,
            "MAG": 19,
            "WIS": 16
        },
        "passive": {
            "name": "Curse of Gold",
            "text": "Any enemy that lands a physical hit on Midas risks partial petrification (roll a die: on 1-5, attacker’s damage is halved, 5-10, attacker gets -10 HP.). Can touch non-living objects and turn them to gold (environmental or puzzle use only). Allies touching Midas take -1 Defense for 1 turn (risk of gold spreading)."
        },
        "abilities": [
            {
                "id": "MIDAS_AB1",
                "name": "Golden Touch",
                "power": 6,
                "type": "physical",
                "text": "Effect: Target is stunned for 1 turn, if rolls 16-20, 2 turns."
            },
            {
                "id": "MIDAS_AB2",
                "name": "Gilded Burst",
                "power": 12,
                "type": "magical",
                "text": "Effect: All enemies in range are blinded by shimmering light (-3 dice)."
            },
            {
                "id": "MIDAS_AB3",
                "name": "Accursed Wealth",
                "power": 18,
                "type": "physical",
                "text": "Effect: Enemy must pass a Wisdom check or be stunned by greed (lose next action)."
            }
        ]
    },
    {
        "id": "ERIS",
        "name": "Eris",
        "canFly": false,
        "stats": {
            "HP": 120,
            "STR": 9,
            "MAG": 20,
            "WIS": 15
        },
        "passive": {
            "name": "Seed of Discord",
            "text": "At the start of every challenge, Eris can cause two enemies to target each other by mistake (once per battle). Immune to confusion, charm, or illusion-based effects. When Eris is hit by a magical attack, attacker has a 25% chance of becoming confused on their next turn."
        },
        "abilities": [
            {
                "id": "ERIS_AB1",
                "name": "Apple of Chaos",
                "power": 10,
                "type": "physical",
                "text": "Effect: Two enemies must pass Wisdom checks or attack each other instead of Eris next turn."
            },
            {
                "id": "ERIS_AB2",
                "name": "Unrest Wave",
                "power": 9,
                "type": "physical",
                "text": "Effect: All enemies suffer -2 to their next rolls if acting together or using combo strategies."
            },
            {
                "id": "ERIS_AB3",
                "name": "Fracture Reality",
                "power": 20,
                "type": "physical",
                "text": "Effect: All enemies in range must roll a die: 1-2: Lose their next turn 3-4: Hurt themselves slightly (5 damage) 5-6: No effect Target effect: Deals damage. HP -20"
            }
        ]
    },
    {
        "id": "PERSEPHONE",
        "name": "Persephone",
        "canFly": false,
        "stats": {
            "HP": 125,
            "STR": 10,
            "MAG": 19,
            "WIS": 17
        },
        "passive": {
            "name": "Queen of Two Worlds",
            "text": "Persephone exists in two states — Spring (Life) and Underworld (Death). She begins in Spring Form. She may switch form once per encounter as a free action.\n Each form changes her abilities’ effects (see below). Spring Form Abilities (Life) 1. Blooming Light - Power: 9\n A burst of healing energy surrounds Persephone. Effect: Heal 10 HP to one ally, or 5 HP to two allies. 2. Vines of Renewal - Power: 12\n Living vines restrain and restore. Effect: One enemy is bound (can’t move) and one ally regains +5 HP. 3. Spring's Embrace - Power: 18\n Unleashes the force of rebirth. Effect: Revive one KO’d ally with 15 HP Underworld Form Abilities (Death) 1. Wither Touch - Power: 9\n Dark magic drains the enemy’s life force. Effect: Deal 10 damage and reduce their magical power by 2 next turn. 2. Chains of Hades - Power: 12\n Summons ethereal chains to immobilize the soul. Effect: Enemy is stunned for 1 turn (no action). 3. Harvest of Shadows - Power: 18\n Draws power from the boundary between worlds. Effect: Deal 8 damage to all enemies. All fallen characters (ally or enemy) are locked from revival for the rest of battle."
        },
        "abilities": [
            {
                "id": "PERSEPHONE_AB1",
                "name": "Blooming Light",
                "power": 9,
                "type": "physical",
                "text": "Effect: Target takes full damage, and surrounding enemies take 5 damage (misses next action if physical)."
            },
            {
                "id": "PERSEPHONE_AB2",
                "name": "Vines of Renewal",
                "power": 12,
                "type": "physical",
                "text": "Effect: All enemies fall prone (next physical attack against them gains +5)."
            },
            {
                "id": "PERSEPHONE_AB3",
                "name": "Spring's Embrace",
                "power": 18,
                "type": "physical",
                "text": "Hercules succumbs to the 12 labors but gets revived even stronger as a demigod Effect: Halves his attack and health for 2 turns After 2 turns, Hercules collapses and dies to get reborn as a demigod If Hercules dies before the 2 turns, he will not receive the buff and perish After being revived, stats are given a multiplier of 1.75x, and is immune to all status effects except for poison in which he receives 2x damage from."
            }
        ]
    },
    {
        "id": "HERCULES",
        "name": "Hercules",
        "canFly": false,
        "stats": {
            "HP": 150,
            "STR": 20,
            "MAG": 4,
            "WIS": 10
        },
        "passive": {
            "name": "Twelve-Labors Resilience",
            "text": "Immune to stun, fear, hesitation, and mind-altering effects When Hercules drops below 50 HP, his next attack deals +5 bonus damage. May carry or shield 1 ally from damage for a turn once per battle."
        },
        "abilities": [
            {
                "id": "HERCULES_AB1",
                "name": "Lion’s Slam",
                "power": 10,
                "type": "physical",
                "text": "Effect: Target takes full damage, and surrounding enemies take 5 damage (misses next action if physical)."
            },
            {
                "id": "HERCULES_AB2",
                "name": "Earthshaker",
                "power": 15,
                "type": "physical",
                "text": "Effect: All enemies fall prone (next physical attack against them gains +5)."
            },
            {
                "id": "HERCULES_AB3",
                "name": "The 12 Labors",
                "power": 20,
                "type": "physical",
                "text": "Hercules succumbs to the 12 labors but gets revived even stronger as a demigod Effect: Halves his attack and health for 2 turns After 2 turns, Hercules collapses and dies to get reborn as a demigod If Hercules dies before the 2 turns, he will not receive the buff and perish After being revived, stats are given a multiplier of 1.75x, and is immune to all status effects except for poison in which he receives 2x damage from."
            }
        ]
    },
    {
        "id": "EUPHROSYNE2",
        "name": "Euphrosyne2",
        "canFly": false,
        "stats": {
            "HP": 115,
            "STR": 7,
            "MAG": 18,
            "WIS": 16
        },
        "passive": {
            "name": "Aura of Joy",
            "text": "All allies gain +2 to their next action if they start their turn near Euphrosyne. Immune to despair, fear, and confusion effects. Once per encounter, can turn a failed ally roll into a success with an encouraging burst of laughter."
        },
        "abilities": [
            {
                "id": "EUPHROSYNE_AB1_2",
                "name": "Gleam of Gladness",
                "power": 9,
                "type": "physical",
                "text": "Effect: Choose up to 2 allies. They gain +3 to their next roll or action."
            },
            {
                "id": "EUPHROSYNE_AB2_2",
                "name": "Laughter's Echo",
                "power": 12,
                "type": "physical",
                "text": "Effect: Cancels one debuff or negative status on each ally (including silence, weakness, or fear)."
            },
            {
                "id": "EUPHROSYNE_AB3_2",
                "name": "Mirthquake",
                "power": 18,
                "type": "physical",
                "text": "Effect: All allies regain +10 HP. All enemies must roll Wisdom: Fail = -2 to all actions next turn due to disoriented laughter."
            }
        ]
    },
    {
        "id": "HYPNOS",
        "name": "Hypnos",
        "canFly": false,
        "stats": {
            "HP": 120,
            "STR": 4,
            "MAG": 20,
            "WIS": 19
        },
        "passive": {
            "name": "Dreamweaver’s Aura",
            "text": "The enemy targeting Hypnos, after Hypnos’ turn, gains Drowsy (-2 to all rolls). Immune to sleep, illusion, or fear effects. Gains a +2 bonus to all rolls when targeting a sleeping enemy."
        },
        "abilities": [
            {
                "id": "HYPNOS_AB1",
                "name": "Drowsy Mist",
                "power": 8,
                "type": "magical",
                "text": "Effect: Inflicts Drowsy on target (-2 all to all rolls)"
            },
            {
                "id": "HYPNOS_AB2",
                "name": "Lullaby of Oblivion",
                "power": 12,
                "type": "physical",
                "text": "Effect: Put one enemy to sleep for one turn (they take no actions). They wake up if damaged."
            },
            {
                "id": "HYPNOS_AB3",
                "name": "Sleep’s Embrace",
                "power": 20,
                "type": "physical",
                "text": "Effect: Put all enemies to sleep for one turn (they take no actions)."
            }
        ]
    },
    {
        "id": "APOLLO",
        "name": "Apollo",
        "canFly": true,
        "stats": {
            "HP": 125,
            "STR": 9,
            "MAG": 20,
            "WIS": 18
        },
        "passive": {
            "name": "Solar Presence",
            "text": "Apollo shines with divine radiance: allies gain +7 to magical power when near someone with this passive. Apollo can use his divine music every round to buff one ally and give the same divine passives. Apollo moves at the speed of light, physical attackers must pass a wisdom check to be able to hit and predict Apollo’s location. Immune to blind, confusion, weather, curse, and darkness-based abilities. Gains +4 to actions involving solving riddles, interpreting visions, or unlocking magical mechanisms and attacks."
        },
        "abilities": [
            {
                "id": "APOLLO_AB1",
                "name": "Blazing Arrow",
                "power": 10,
                "type": "physical",
                "text": "Fires a radiant, solar-charged arrow from his golden bow. Effect: Pierces magical shields of all enemies; deals +10 bonus damage if targets have used a magical attack last turn."
            },
            {
                "id": "APOLLO_AB2",
                "name": "Lyric of Healing / Plague",
                "power": 12,
                "type": "physical",
                "text": "Effect: Restore 18 HP to one ally OR 9 HP to all allies for 2 rounds (may stack)"
            },
            {
                "id": "APOLLO_AB3",
                "name": "Sunburst Prophecy",
                "power": 20,
                "type": "magical",
                "text": "Effect: Blinds all enemies for 1 turn (-3 to next action) and deals 10 burning damage to all for 2 rounds. If the enemy was under a debuff, the damage becomes 20 burning damage to all for 2 rounds."
            }
        ]
    },
    {
        "id": "ARES",
        "name": "Ares",
        "canFly": false,
        "stats": {
            "HP": 150,
            "STR": 20,
            "MAG": 4,
            "WIS": 7
        },
        "passive": {
            "name": "Battle Frenzy",
            "text": "Ares gains +2/+5/+10 base damage when below 120/75/1 HP. Immune to fear, hesitation, and mind-altering effects. May immediately counterattack when hit by a melee attack refreshes once per action of Ares (this counter attack is considered a follow-up attack and is not categorised as a turn thus cannot refresh this passive)."
        },
        "abilities": [
            {
                "id": "ARES_AB1",
                "name": "Warcry",
                "power": 0,
                "type": "physical",
                "text": "Effect: Ares taunts all nearby enemies. The enemies are blinded with rage; their technique is sloppy, dealing 25% less damage to Ares. This taunt and debuff dispels after the enemies attack Ares."
            },
            {
                "id": "ARES_AB2",
                "name": "Spear of Blood",
                "power": 15,
                "type": "physical",
                "text": "Effect: If the enemies are under the effect of Ares’ Warcry Spear of blood's power increases to 20."
            },
            {
                "id": "ARES_AB3",
                "name": "The God of War’s Wrath",
                "power": 25,
                "type": "physical",
                "text": "Voiceline (optional but to be read out by the player “...” is like a 2 second pause). Bleed me dry… break my body… shatter my bones… yet I stand with pride. … My body will fall… but my wrath WILL CONSUME YOU ALL!. Effect: Consumes all Ares’ HP until he is left with 1 HP. Each point of HP lost including HP lost the entire game with a cap of 150 adds a 5% multiplier to the power “The God of War’s Wrath”. It is an AOE attack dividing the damage equally amongst enemies of Ares’ choosing the max being the entire enemy team. Born Anew in Blood”- After the use of “The God of War's Wrath” If Ares successfully kills at least 2 enemies his HP is set to 750. If not he is rendered immobile and can only act after his hp goes over 75."
            }
        ]
    },
    {
        "id": "ARTEMIS",
        "name": "Artemis",
        "canFly": true,
        "stats": {
            "HP": 130,
            "STR": 13,
            "MAG": 15,
            "WIS": 17
        },
        "passive": {
            "name": "Moonlit Precision",
            "text": "Artemis never misses when attacking enemies under a condition (stunned, weakened, slowed). She is immune to tracking, detection, or magic that reveals location. Can detect hidden enemies or traps automatically once per challenge."
        },
        "abilities": [
            {
                "id": "ARTEMIS_AB1",
                "name": "Lunar Arrow",
                "power": 12,
                "type": "physical",
                "text": "Effect: Reduces enemy healing by 2 for one round."
            },
            {
                "id": "ARTEMIS_AB2",
                "name": "Snare Shot",
                "power": 12,
                "type": "physical",
                "text": "Effect: Enemy loses their next movement or flying action. -2 to their next physical action."
            },
            {
                "id": "ARTEMIS_AB3",
                "name": "Wild Hunt",
                "power": 20,
                "type": "physical",
                "text": "Effect: Deal 10 damage to all enemies. If only one target is hit, they take the full 20 damage."
            }
        ]
    },
    {
        "id": "HERMES",
        "name": "Hermes",
        "canFly": true,
        "stats": {
            "HP": 125,
            "STR": 12,
            "MAG": 17,
            "WIS": 20
        },
        "passive": {
            "name": "Divine Speed",
            "text": "Hermes may always act first in challenges unless an enemy has a higher Wisdom. Once per battle, he can take two actions in a single turn. Immune to slowing or entrapment. effects. Can escape traps automatically."
        },
        "abilities": [
            {
                "id": "HERMES_AB1",
                "name": "Flash Step",
                "power": 10,
                "type": "physical",
                "text": "Effect: Deal 1.25x damage of the attack. Hermes cannot be targeted next turn. 2. Trickster’s Gambit - Power: ?\n Steals opponent’s last used attack and counters it. Effect: Copies the power  and effect of the enemy’s previous attack, using it against them."
            },
            {
                "id": "HERMES_AB2",
                "name": "Cyclone Courier",
                "power": 18,
                "type": "physical",
                "text": "Effect: Deals 18 damage and pushes flying enemies to land (removes flight for 1 turn)."
            }
        ]
    },
    {
        "id": "DIONYSUS._._.._#",
        "name": "Dionysus. . .. #",
        "canFly": false,
        "stats": {
            "HP": 120,
            "STR": 9,
            "MAG": 19,
            "WIS": 15
        },
        "passive": {
            "name": "Bacchic Aura",
            "text": "Enemies within close range must roll a Wisdom check at the start of each r ound or suffer confusion (-2 to their next action). Allies gain +2 to magic-based attacks when within Dionysus’s presence. Immune to madness, confusion, charm, or hallucination effects."
        },
        "abilities": [
            {
                "id": "DIONYSUS._._.._#_AB1",
                "name": "Winebind",
                "power": 10,
                "type": "physical",
                "text": "Effect: Enemy skips their movement next turn."
            },
            {
                "id": "DIONYSUS._._.._#_AB2",
                "name": "Madness Mist",
                "power": 14,
                "type": "magical",
                "text": "Effect: Poisons the enemy that deals 3 HP per round lasting 2 rounds"
            },
            {
                "id": "DIONYSUS._._.._#_AB3",
                "name": "Ecstatic Frenzy",
                "power": 20,
                "type": "physical",
                "text": ""
            }
        ]
    },
    {
        "id": "TELEMACHUS",
        "name": "Telemachus",
        "canFly": false,
        "stats": {
            "HP": 130,
            "STR": 14,
            "MAG": 6,
            "WIS": 15
        },
        "passive": {
            "name": "Heir of Odysseus",
            "text": "Gains +2 defense when fighting beside an ally. Can analyze enemy behavior after the first round (gain advantage on second attack against same enemy). Once per challenge, may copy an enemy’s last attack (with same power) if it’s physical."
        },
        "abilities": [
            {
                "id": "TELEMACHUS_AB1",
                "name": "Blade of Ithaca",
                "power": 10,
                "type": "physical",
                "text": "Effect: If used after observing the same enemy, it ignores half of their defense."
            },
            {
                "id": "TELEMACHUS_AB2",
                "name": "Loyal Rally",
                "power": 0,
                "type": "physical",
                "text": "Effect: All allies gain +2 to their next physical action."
            },
            {
                "id": "TELEMACHUS_AB3",
                "name": "Valiant Charge",
                "power": 18,
                "type": "physical",
                "text": "Effect: Deals heavy damage; if flanking with an ally, deals +5 bonus damage."
            }
        ]
    },
    {
        "id": "ATALANTA",
        "name": "Atalanta",
        "canFly": false,
        "stats": {
            "HP": 120,
            "STR": 17,
            "MAG": 4,
            "WIS": 14
        },
        "passive": {
            "name": "Huntress’s Reflex",
            "text": "Atalanta always dodges the first attack made against her in every challenge. Gains +2 to attacks against any enemy that has already acted this round. She cannot be trapped or slowed — she always escapes restraints on her next turn."
        },
        "abilities": [
            {
                "id": "ATALANTA_AB1",
                "name": "Piercing Arrow",
                "power": 12,
                "type": "physical",
                "text": "Effect: Ignores 5 points of defense. Bonus +2 if the enemy is airborne."
            },
            {
                "id": "ATALANTA_AB2",
                "name": "Hunter’s Ambush",
                "power": 8,
                "type": "physical",
                "text": "Effect: If used immediately after avoiding an attack, deals double damage."
            },
            {
                "id": "ATALANTA_AB3",
                "name": "Volley of Wrath",
                "power": 18,
                "type": "physical",
                "text": "Effect: Hits up to 3 enemies for 6 damage each, or focus all 18 damage on one target."
            }
        ]
    },
    {
        "id": "EROS",
        "name": "Eros",
        "canFly": true,
        "stats": {
            "HP": 125,
            "STR": 6,
            "MAG": 20,
            "WIS": 15
        },
        "passive": {
            "name": "Aura of Allure",
            "text": "When targeted by an attack, Eros’s player may attempt a pickup line. If the GM rules it high-quality, the attack is reduced by -5 power. Immune to charm, fear, and emotional status effects. Allies who start their turn near Eros gain +2 to magical power and +1 wisdom for that round."
        },
        "abilities": [
            {
                "id": "EROS_AB1",
                "name": "Arrow of Infatuation",
                "power": 12,
                "type": "physical",
                "text": "Effect: Enemy skips their next offensive action and is distracted (-2 to physical actions or Wisdom depending on which stat is higher) for 1 round."
            },
            {
                "id": "EROS_AB2",
                "name": "Heartbind",
                "power": 10,
                "type": "physical",
                "text": "Effect: For 2 rounds, damage done to one is also felt by the other (60% shared damage)."
            },
            {
                "id": "EROS_AB3",
                "name": "Love’s Command",
                "power": 18,
                "type": "physical",
                "text": "Effect: One enemy must pass a Wisdom save or act in favor of Eros's team next turn (defend, heal, or skip their attack (skipping the attack reduces the enemy’s defense by on the next round) — teacher’s discretion or dice roll). If the enemy succeeds the Wisdom save, they take +2 damage from all sources on the next round."
            }
        ]
    },
    {
        "id": "PENELOPE",
        "name": "Penelope",
        "canFly": false,
        "stats": {
            "HP": 125,
            "STR": 11,
            "MAG": 10,
            "WIS": 20
        },
        "passive": {
            "name": "Weaver’s Patience",
            "text": "Penelope takes -2 damage from all delayed or magical attacks. Once per battle, she may “undo” a negative effect cast on an ally (as if it never happened). Gains automatic success on logic or deception-based puzzles/challenges."
        },
        "abilities": [
            {
                "id": "PENELOPE_AB1",
                "name": "Thread of Delay",
                "power": 10,
                "type": "physical",
                "text": "Effect: Enemy's next attack takes place round(s) later than planned (amount of rounds depend on penelope’s will). If it’s a special skill, it fails completely."
            },
            {
                "id": "PENELOPE_AB2",
                "name": "Shield of Loyalty",
                "power": 0,
                "type": "physical",
                "text": "Effect: One ally takes no damage this round. Can be used once per challenge. Being under protection of the shield, the ally also heals by +10 Hp per attack while shielded (if the ally's Hp heals over their maximum, then the excess applies to the lowest Hp member of the team."
            },
            {
                "id": "PENELOPE_AB3",
                "name": "Pattern of Truth",
                "power": 16,
                "type": "physical",
                "text": "Effect: Removes any disguise, illusion, or magical buff from a target. If no such buff exists, deals 16 damage instead."
            }
        ]
    },
    {
        "id": "ASTERIA",
        "name": "Asteria",
        "canFly": true,
        "stats": {
            "HP": 120,
            "STR": 6,
            "MAG": 19,
            "WIS": 18
        },
        "passive": {
            "name": "Prophetic Glimpse",
            "text": "At the start of each battle, Asteria sees a vision of danger. She may avoid one attack per enemy completely at any point in the challenge. Enemies suffer -2 to any magical defense rolls when in darkness or indoors. Puzzles involving memory or prediction are easier (1 bonus hint or reroll)."
        },
        "abilities": [
            {
                "id": "ASTERIA_AB1",
                "name": "Meteor Spark",
                "power": 12,
                "type": "physical",
                "text": "Effect: Deals splash damage to 2 adjacent enemies (10 each) or full 20 to one."
            },
            {
                "id": "ASTERIA_AB2",
                "name": "Starlight Veil",
                "power": 0,
                "type": "physical",
                "text": "Effect: That ally gains +15 HP regen for 2 rounds and cannot be targeted by magical attacks this turn. Gains 20 HP immediately."
            },
            {
                "id": "ASTERIA_AB3",
                "name": "Cosmic Collapse",
                "power": 18,
                "type": "physical",
                "text": "Effect: All enemies in range roll Wisdom. If they fail, they skip their next magical action and take 30 damage split among them. Regardless of result, heal all allies for 40 HP"
            }
        ]
    },
    {
        "id": "MORPHEUS",
        "name": "Morpheus",
        "canFly": true,
        "stats": {
            "HP": 120,
            "STR": 5,
            "MAG": 19,
            "WIS": 20
        },
        "passive": {
            "name": "Dreamweaver’s Aura",
            "text": "Enemies within range have a 15% chance to miss due to illusion. Immune to sleep, confusion, or hallucination effects. In any puzzle requiring imagination or emotional insight, Morpheus may reroll twice and choose the best."
        },
        "abilities": [
            {
                "id": "MORPHEUS_AB1",
                "name": "Sleep Dust",
                "power": 12,
                "type": "physical",
                "text": "Effect: Target loses their next turn if they fail a Wisdom check."
            },
            {
                "id": "MORPHEUS_AB2",
                "name": "Dream Mirror",
                "power": 12,
                "type": "physical",
                "text": "Effect: Can only be used in response to a magical attack. Requires Wisdom vs. Wisdom roll."
            },
            {
                "id": "MORPHEUS_AB3",
                "name": "Oneirostorm",
                "power": 20,
                "type": "magical",
                "text": "Effect: All enemies must roll Wisdom. On failure, they suffer 20 split damage and -2 to magical power for 2 rounds."
            }
        ]
    },
    {
        "id": "HORME",
        "name": "Horme",
        "canFly": false,
        "stats": {
            "HP": 125,
            "STR": 16,
            "MAG": 5,
            "WIS": 12
        },
        "passive": {
            "name": "Unstoppable Urge",
            "text": "Gains +2 damage on any attack made immediately after dodging or taking damage. Immune to effects that would cause hesitation, indecision, or paralysis. If she successfully lands an attack, she may move or act again (once per challenge)."
        },
        "abilities": [
            {
                "id": "HORME_AB1",
                "name": "Drive Forward",
                "power": 10,
                "type": "physical",
                "text": "Effect: If used after moving or dodging, gains +4 bonus damage."
            },
            {
                "id": "HORME_AB2",
                "name": "Zeal Surge",
                "power": 8,
                "type": "magical",
                "text": "Effect: Target gains +3 physical strength for their next turn."
            },
            {
                "id": "HORME_AB3",
                "name": "Relentless Barrage",
                "power": 18,
                "type": "physical",
                "text": "Effect: Split 18 damage among 1-3 targets. If any fall to 0 HP, Horme may act again next round."
            }
        ]
    },
    {
        "id": "ARCHIMEDES",
        "name": "Archimedes",
        "canFly": false,
        "stats": {
            "HP": 115,
            "STR": 6,
            "MAG": 10,
            "WIS": 20
        },
        "passive": {
            "name": "Eureka!",
            "text": "Archimedes may instantly solve any mechanical or logic puzzle in team challenges once per challenge. He may build one custom trap or defense per challenge (effect depends on situation). Gains +2 to all defensive reactions if he has one round to prepare."
        },
        "abilities": [
            {
                "id": "ARCHIMEDES_AB1",
                "name": "Lever Strike",
                "power": 8,
                "type": "physical",
                "text": "Effect: Target loses their next physical action unless they beat Archimedes in a Strength vs. Wisdom roll."
            },
            {
                "id": "ARCHIMEDES_AB2",
                "name": "Calculated Counter",
                "power": 12,
                "type": "physical",
                "text": "Effect: If used in response to an attack, halves incoming damage and reflects 6 damage back."
            },
            {
                "id": "ARCHIMEDES_AB3",
                "name": "Catapult Trap",
                "power": 18,
                "type": "physical",
                "text": "Effect: Deals 18 damage to up to 2 targets. Can only be used once per challenge."
            }
        ]
    },
    {
        "id": "ASCLEPIUS",
        "name": "Asclepius",
        "canFly": false,
        "stats": {
            "HP": 130,
            "STR": 7,
            "MAG": 18,
            "WIS": 20
        },
        "passive": {
            "name": "Divine Physician",
            "text": "Asclepius automatically restores 5 HP + 1 HP per Wisdom point above 15 to the lowest-health teammate at the end of each round. Immune to poison, disease, and decay effects. Can bring a fallen ally (0 HP) back into action with 10 HP once per challenge."
        },
        "abilities": [
            {
                "id": "ASCLEPIUS_AB1",
                "name": "Purge Affliction",
                "power": 10,
                "type": "physical",
                "text": "Effect: Removes debuffs or ongoing damage from an ally and deals minor damage to nearby enemies. How many HP do I deduct from my “minor damage” po?"
            },
            {
                "id": "ASCLEPIUS_AB2",
                "name": "Serpent of Recovery",
                "power": 18,
                "type": "physical",
                "text": "Effect: Restores 10 HP per round for 2 rounds or restores 8 HP per round for 3 rounds or deals 18 magical damage to a foe if used offensively (user’s choice). BUT: If the user roles a 20: For ally: Restores the target AND THE USER to full HP instantly. Removes ALL debuffs, poisons, curse and negative effects For foe: Deals 20 magical damage to the selected foe and gets stunned on the next turn. Foe can’t get healed for 1 round. LIMITATION: User must skip the next turn."
            }
        ]
    },
    {
        "id": "HESYCHIA",
        "name": "Hesychia",
        "canFly": false,
        "stats": {
            "HP": 120,
            "STR": 5,
            "MAG": 18,
            "WIS": 20
        },
        "passive": {
            "name": "Aura of Stillness",
            "text": "Enemies who attempt to target Hesychia with magical or verbal attacks must first succeed a Wisdom check. If they fail, the action fizzles. Team members within her presence gain +2 Wisdom during group challenges requiring focus, patience, or control."
        },
        "abilities": [
            {
                "id": "HESYCHIA_AB1",
                "name": "Silence Veil",
                "power": 7,
                "type": "physical",
                "text": "Effect: Prevents one enemy from casting or using any verbal or magical skill for 1 round."
            },
            {
                "id": "HESYCHIA_AB2",
                "name": "Tranquil Pulse",
                "power": 12,
                "type": "physical",
                "text": "Effect: Two enemies suffer -3 to Physical Strength or Magic Power (user’s choice) for 2 rounds."
            },
            {
                "id": "HESYCHIA_AB3",
                "name": "Stasis Field",
                "power": 18,
                "type": "physical",
                "text": "Effect: One target cannot act next round. Another target takes 10 damage and moves last for 2 rounds."
            }
        ]
    },
    {
        "id": "HEBE",
        "name": "Hebe",
        "canFly": true,
        "stats": {
            "HP": 125,
            "STR": 6,
            "MAG": 19,
            "WIS": 17
        },
        "passive": {
            "name": "Cupbearer’s Blessing",
            "text": "At the start of each challenge, Hebe randomly buffs one ally with +3 to Physical Strength, Wisdom, or Magical Power for 3 rounds. Allies healed by Hebe gain +1 Defense for the next round."
        },
        "abilities": [
            {
                "id": "HEBE_AB1",
                "name": "Rejuvenating Breeze",
                "power": 10,
                "type": "physical",
                "text": "Effect: All allies gain +2 Magical Power or Wisdom (choose one) for the next round."
            },
            {
                "id": "HEBE_AB2",
                "name": "Youth Unbound",
                "power": 18,
                "type": "physical",
                "text": "Effect: One ally regains a used ability and 10 HP. Secondary effect: If the target was below 30 HP, they gain an additional turn immediately."
            }
        ]
    },
    {
        "id": "NYX",
        "name": "Nyx",
        "canFly": true,
        "stats": {
            "HP": 150,
            "STR": 15,
            "MAG": 20,
            "WIS": 19
        },
        "passive": {
            "name": "Primordial Dread",
            "text": "Any enemy who first faces Nyx in a challenge must pass a Wisdom check or suffer Fear, reducing their Physical Strength by 5 for 2 rounds. Shadow-based magical attacks against her are reduced by half, if HP drops to 50, she can absorb the shadow da.mage"
        },
        "abilities": [
            {
                "id": "NYX_AB1",
                "name": "Shadow Bind",
                "power": 12,
                "type": "physical",
                "text": "Effect: One enemy loses their next action unless they succeed a Strength check. If they fail, they are stunned and Nyx may drain 15 HP from them and heal herself"
            },
            {
                "id": "NYX_AB2",
                "name": "Veil of Eternal Night",
                "power": 14,
                "type": "physical",
                "text": "Effect: All enemies suffer -3 to their next magical or wisdom-based ability."
            },
            {
                "id": "NYX_AB3",
                "name": "Oblivion Pulse",
                "power": 20,
                "type": "physical",
                "text": "Effect: Deal 25 damage to up to 2 enemies. If their HP is below 30, they cannot act next round."
            }
        ]
    },
    {
        "id": "SISYPHUS",
        "name": "Sisyphus",
        "canFly": false,
        "stats": {
            "HP": 145,
            "STR": 14,
            "MAG": 7,
            "WIS": 18
        },
        "passive": {
            "name": "Eternal Struggle",
            "text": "When Sisyphus is reduced to 0 HP, he returns to battle once per challenge with 20 HP, as long as at least one teammate is still active. Gains +2 Defense every time he is hit consecutively (resets if he dodges or is not targeted the next round)."
        },
        "abilities": [
            {
                "id": "SISYPHUS_AB1",
                "name": "Boulder Bash",
                "power": 10,
                "type": "physical",
                "text": "Effect: Deals damage and reduces the target’s Defense by 2 for one turn."
            },
            {
                "id": "SISYPHUS_AB2",
                "name": "Cunning Delay",
                "power": 6,
                "type": "physical",
                "text": "Effect: One enemy’s next ability is delayed by 1 round. If the enemy uses it anyway, it backfires for 5 damage."
            },
            {
                "id": "SISYPHUS_AB3",
                "name": "Gravity Curse",
                "power": 16,
                "type": "physical",
                "text": "Effect: Target enemy becomes \"slowed\" and must skip every other turn for the next 2 rounds."
            }
        ]
    },
    {
        "id": "HELEN_OF_TROY",
        "name": "Helen Of Troy",
        "canFly": false,
        "stats": {
            "HP": 120,
            "STR": 6,
            "MAG": 18,
            "WIS": 17
        },
        "passive": {
            "name": "Face That Launched a Thousand Ships",
            "text": "Once per challenge, Helen can redirect an attack aimed at her to another enemy or ally. Enemies who attack Helen must roll a Wisdom check; on failure, their attack does half damage as they hesitate. Her illusions cause confusion—enemies targeting her suffer -2 accuracy for 2 rounds after each missed attack."
        },
        "abilities": [
            {
                "id": "HELEN_OF_TROY_AB1",
                "name": "Mirage Cloak",
                "power": 8,
                "type": "physical",
                "text": "Effect: For 1 round, all attacks on her have a 50% chance to miss."
            },
            {
                "id": "HELEN_OF_TROY_AB2",
                "name": "Lover’s Doubt",
                "power": 12,
                "type": "physical",
                "text": "Effect: Target skips their next turn or must use a weaker action."
            },
            {
                "id": "HELEN_OF_TROY_AB3",
                "name": "Phantom Duel",
                "power": 18,
                "type": "physical",
                "text": "Effect: Enemy is locked in mental battle with the illusion for 1 turn (no actions), then suffers 10 damage and -3 Magical Power next turn."
            }
        ]
    },
    {
        "id": "ICARUS",
        "name": "Icarus",
        "canFly": true,
        "stats": {
            "HP": 125,
            "STR": 14,
            "MAG": 8,
            "WIS": 10
        },
        "passive": {
            "name": "Wings of Wax",
            "text": "Special Effect: If in the same team as Daedalus, Icarus gets +2 to his skills’ base power (except when Overheated), gets to move before most other units, and his “Overheated” status activates with 3+ abilities used that have 12+ Power. If he uses 2 or more high-power abilities in a row (Power 15+), he gains the \"Overheated\" status, losing flight, taking 40% more damage for 2 turns, and his skills change drastically. If (somehow) Overheated for more than 6 turns, he loses the status and goes back to normal. Gains +2 Physical Strength when in flight for more than one consecutive round."
        },
        "abilities": [
            {
                "id": "ICARUS_AB1",
                "name": "Decisive Dive / Crash & Burn",
                "power": 8,
                "type": "physical",
                "text": "Overheated): Icarus’s molten wings malfunction and blitz into an enemy. Effect: 25% chance to knock the enemy down, causing them to lose 1 Defense next round. When Overheated: Burns the enemy for 3 turns (-2 HP per turn), and a 50% chance to disable attacking skills next turn (non-attacking skills still work)."
            },
            {
                "id": "ICARUS_AB2",
                "name": "Blinding Flight / Overzealous Flight",
                "power": 10,
                "type": "physical",
                "text": "Icarus zips around the field, leaving a trail of blinding sunlight. Overheated): Parts of Icarus’s wings start to crumble, falling onto his enemies below. Effect: All enemies have -2 to accuracy for the next round. When Overheated: Burns every enemy for 2 turns (-2 HP per turn), and causes them to take 20% more damage next turn."
            },
            {
                "id": "ICARUS_AB3",
                "name": "Solar Rush / Joyous Tragedy",
                "power": 18,
                "type": "magical",
                "text": "Overheated): Icarus, laughing as cheerfully as ever, and his target crash into the sea together, never to return… Effect: Deals heavy damage, but if used again next turn, triggers Overheated tqtq (See Special Passive). When Overheated: Icarus’s target loses their current turn, then is severely burnt for 5 turns (-4 HP per turn). Icarus is also severely burnt for 3 turns (-4 HP per turn), and extends his Overheated status by 1 more turn."
            }
        ]
    },
    {
        "id": "ORPHEUS",
        "name": "Orpheus",
        "canFly": false,
        "stats": {
            "HP": 115,
            "STR": 7,
            "MAG": 16,
            "WIS": 19
        },
        "passive": {
            "name": "Lyre of Souls",
            "text": "Orpheus can cast minor calming effects passively—hostile creatures or enemies with 10 or lower Wisdom suffer -1 to their action rolls when he's playing. Once per challenge, Orpheus can revive a downed ally with 10 HP by singing a verse from the underworld. Immune to fear and confusion-based effects."
        },
        "abilities": [
            {
                "id": "ORPHEUS_AB1",
                "name": "Dissonant Melody",
                "power": 9,
                "type": "physical",
                "text": "Effect: Target must reroll their next attack and take the lower value."
            },
            {
                "id": "ORPHEUS_AB2",
                "name": "Hymn of Binding",
                "power": 13,
                "type": "physical",
                "text": "Effect: Target is silenced for 2 rounds (no abilities)."
            },
            {
                "id": "ORPHEUS_AB3",
                "name": "Echo of Eurydice",
                "power": 18,
                "type": "physical",
                "text": "Effect: All enemies in range skip their next action unless they pass a Wisdom check."
            }
        ]
    },
    {
        "id": "MNEMOSYNE",
        "name": "Mnemosyne",
        "canFly": false,
        "stats": {
            "HP": 120,
            "STR": 6,
            "MAG": 20,
            "WIS": 20
        },
        "passive": {
            "name": "Archive of Eternity",
            "text": "Mnemosyne can recall any forgotten clue or reveal one hidden detail once per challenge (great for puzzle tasks or story-based quests). Allies receive +4 to Wisdom checks when she is conscious. Immune to mind-altering or memory-loss effects."
        },
        "abilities": [
            {
                "id": "MNEMOSYNE_AB1",
                "name": "Flash of Memory",
                "power": 10,
                "type": "physical",
                "text": "Effect: Target skips their next magical ability or suffers -2 Magical Power for one round. Target is unable to use Magical damage skills for 1 round. Target also suffers -20 Physical Strength/Magical Power for 3 rounds."
            },
            {
                "id": "MNEMOSYNE_AB2",
                "name": "Gift of Remembrance",
                "power": 14,
                "type": "physical",
                "text": "Effect: Ally regains 30 HP and gains +3 to their next action."
            },
            {
                "id": "MNEMOSYNE_AB3",
                "name": "Oblivion Fog",
                "power": 18,
                "type": "physical",
                "text": "Effect: All enemies lose access to one of their attacks (randomly chosen) for 2 rounds. All enemies lose access to one of their attacks (chosen by Mnemosyne) for 2 rounds (only skills 1 and 2)."
            }
        ]
    },
    {
        "id": "THEMIS",
        "name": "Themis",
        "canFly": false,
        "stats": {
            "HP": 125,
            "STR": 9,
            "MAG": 18,
            "WIS": 20
        },
        "passive": {
            "name": "Scales of Order",
            "text": "Themis always acts first in ties (initiative or decision-based). If an enemy uses the same ability twice in a row, they take 5 damage from “divine backlash.” Allies within range are protected from trickery: they gain +2 on saving throws against illusions or deceptions."
        },
        "abilities": [
            {
                "id": "THEMIS_AB1",
                "name": "Verdict Strike",
                "power": 12,
                "type": "physical",
                "text": "Effect: If they caused harm last round, they take double damage. If not, standard damage."
            },
            {
                "id": "THEMIS_AB2",
                "name": "Prophetic Guard",
                "power": 10,
                "type": "physical",
                "text": "Effect: Ally takes half damage from the next attack and gains +1 Defense for the next 2 turns."
            },
            {
                "id": "THEMIS_AB3",
                "name": "Law of Retribution",
                "power": 18,
                "type": "physical",
                "text": "Effect: All enemies who used magic or high-damage attacks last round take 10 damage and are stunned for one turn."
            }
        ]
    },
    {
        "id": "MEDUSA",
        "name": "Medusa",
        "canFly": false,
        "stats": {
            "HP": 120,
            "STR": 14,
            "MAG": 18,
            "WIS": 12
        },
        "passive": {
            "name": "Gorgon’s Aura",
            "text": "Any enemy who directly faces Medusa must reroll their first attack each round. Immune to charm or beauty-based effects. If Medusa is not seen (stealth/surprise), her next magical attack deals +5 bonus damage."
        },
        "abilities": [
            {
                "id": "MEDUSA_AB1",
                "name": "Petrifying Gaze",
                "power": 18,
                "type": "physical",
                "text": "Effect: Target is stunned for one turn and takes 8 damage. If they fail a Wisdom check, they lose their next action entirely."
            },
            {
                "id": "MEDUSA_AB2",
                "name": "Venom Lash",
                "power": 12,
                "type": "physical",
                "text": "Effect: Target takes damage and suffers -2 to physical actions for 2 turns due to poison."
            },
            {
                "id": "MEDUSA_AB3",
                "name": "Cursed Reflection",
                "power": 10,
                "type": "physical",
                "text": "Effect: Reflects half the damage of the last attack back to its source. Usable only once every 3 turns."
            }
        ]
    },
    {
        "id": "NEMESIS",
        "name": "Nemesis",
        "canFly": false,
        "stats": {
            "HP": 135,
            "STR": 16,
            "MAG": 17,
            "WIS": 16
        },
        "passive": {
            "name": "Eye for an Eye",
            "text": "If Nemesis is attacked, the attacker automatically takes 5 retaliation damage. Deals +3 bonus damage to enemies with more HP than her. Immune to damage boosts from enemies who have attacked more than once in the previous round."
        },
        "abilities": [
            {
                "id": "NEMESIS_AB1",
                "name": "Retribution Strike",
                "power": 14,
                "type": "physical",
                "text": "Effect: Damage increases by +5 if the target attacked an ally in the last round."
            },
            {
                "id": "NEMESIS_AB2",
                "name": "Balance Breaker",
                "power": 10,
                "type": "physical",
                "text": "Effect: Enemy with the highest HP takes 10 damage and suffers -2 to Defense for 2 turns."
            },
            {
                "id": "NEMESIS_AB3",
                "name": "Scales of Wrath",
                "power": 18,
                "type": "physical",
                "text": "Effect: All enemies who dealt damage last round take 8 damage and are silenced for their next turn."
            }
        ]
    },
    {
        "id": "ECHO",
        "name": "Echo",
        "canFly": false,
        "stats": {
            "HP": 115,
            "STR": 7,
            "MAG": 17,
            "WIS": 18
        },
        "passive": {
            "name": "",
            "text": "Any skill that Echo mimics is used at 90% power of the original Immune to echoing effects or voice-based control.n Gains a +2 magic boost if fighting alongside Narcissus (if included in game)."
        },
        "abilities": [
            {
                "id": "ECHO_AB1",
                "name": "Reflective Voice Reverb",
                "power": 12,
                "type": "physical",
                "text": "Effect: Target must skip their verbal/magic action next round or take 5 psychic damage. Mimics a skill last used by an ally"
            },
            {
                "id": "ECHO_AB2",
                "name": "Illusory Chorus Reflect",
                "power": 10,
                "type": "physical",
                "text": "Effect: All enemies suffer -2 accuracy for 1 turn. One enemy takes 6 damage from sensory overload. Mimics a skill last used by an enemy"
            },
            {
                "id": "ECHO_AB3",
                "name": "Echo Trap Resound",
                "power": 16,
                "type": "physical",
                "text": "Effect: If the enemy used a magical attack last turn, they suffer its base damage again. Mimics two skills at the same time, one from an ally and another from an enemy, but at 85% power of the original, but if only enemies have attacked, mimic two moves enemies last used, same for allies"
            }
        ]
    },
    {
        "id": "CHRONOS",
        "name": "Chronos",
        "canFly": false,
        "stats": {
            "HP": 125,
            "STR": 6,
            "MAG": 20,
            "WIS": 20
        },
        "passive": {
            "name": "Eternal Cycle",
            "text": "Every 3 rounds, Chronos automatically replays one of his own past actions (he chooses which). Immune to time-based or memory-disrupting abilities. Gains +2 magic when facing enemies who have acted twice in a row."
        },
        "abilities": [
            {
                "id": "CHRONOS_AB1",
                "name": "Time Skip",
                "power": 9,
                "type": "physical",
                "text": "Effect: The target is removed from the action order for 1 round."
            },
            {
                "id": "CHRONOS_AB2",
                "name": "Time Loop",
                "power": 14,
                "type": "physical",
                "text": "Effect: Target must re-attempt the same move next round; if it was a failed attack, they must fail again."
            },
            {
                "id": "CHRONOS_AB3",
                "name": "Collapse of the Hourglass",
                "power": 20,
                "type": "physical",
                "text": "Effect: All enemies lose 3 Defense for 2 turns and take 10 magical damage. Allies heal +5 HP from the restored timeline."
            }
        ]
    },
    {
        "id": "CLOTHO",
        "name": "Clotho",
        "canFly": false,
        "stats": {
            "HP": 120,
            "STR": 6,
            "MAG": 18,
            "WIS": 19
        },
        "passive": {
            "name": "Threadspinner",
            "text": "Once per game challenge, Clotho may \"spin fate\": an ally automatically succeeds on a failed action. Only once per game challenge, Clotho may “spin fate”; a chosen ally fully succeeds (rolls 20) on an action. Heals 5 HP automatically to the ally with the lowest health every 3 rounds. Heals 20 HP automatically to the two allies with the lowest health every 2 turns Clotho takes. Immune to “first strike” effects (she always acts as if she has foresight). Immune to first strike effects, ambush effects, and surprise effects, as Clotho has foresight."
        },
        "abilities": [
            {
                "id": "CLOTHO_AB1",
                "name": "Spindle Shot",
                "power": 8,
                "type": "physical",
                "text": "Effect: Enemy takes damage and loses their next bonus (if any). Enemy takes 12 damage and is applied a Weaken debuff: when dealing any type of DMG, deal 20% less DMG for one turn. High roll: 20% -> 35%."
            },
            {
                "id": "CLOTHO_AB2",
                "name": "Reweave",
                "power": 12,
                "type": "physical",
                "text": "Effect: Heals 15 HP or removes one status effect (e.g., silence, confusion). Heals 35 HP or removes one chosen status effect (e.g., silence, confusion, etc.). High roll: able to heal and cleanse simultaneously."
            },
            {
                "id": "CLOTHO_AB3",
                "name": "Fate Entanglement",
                "power": 17,
                "type": "physical",
                "text": "Effect: All enemies roll Disadvantage (roll twice, use lower) on next turn. All allies gain Advantage (roll twice, use higher) for one turn."
            }
        ]
    },
    {
        "id": "NARCISSUS",
        "name": "Narcissus",
        "canFly": false,
        "stats": {
            "HP": 115,
            "STR": 8,
            "MAG": 19,
            "WIS": 14
        },
        "passive": {
            "name": "Mirror Veil",
            "text": "The first magical attack targeting Narcissus each round has a 50% chance to reflect back at the attacker. Enemies targeting Narcissus suffer -2 to their accuracy if they've already attacked that round. Immune to charm or seduction-based abilities."
        },
        "abilities": [
            {
                "id": "NARCISSUS_AB1",
                "name": "Dazzling Gaze",
                "power": 9,
                "type": "physical",
                "text": "Effect: Target skips their next basic attack."
            },
            {
                "id": "NARCISSUS_AB2",
                "name": "Reflection Field",
                "power": 13,
                "type": "physical",
                "text": "Effect: One enemy becomes disoriented. Their next action targets a random nearby character (enemy or ally)."
            },
            {
                "id": "NARCISSUS_AB3",
                "name": "Narcissistic Bloom",
                "power": 18,
                "type": "physical",
                "text": "Effect: All enemies lose 3 defense for 2 rounds and roll disadvantage on spell saves."
            }
        ]
    },
    {
        "id": "EIRENE",
        "name": "Eirene",
        "canFly": false,
        "stats": {
            "HP": 135,
            "STR": 7,
            "MAG": 17,
            "WIS": 18
        },
        "passive": {
            "name": "Aura of Peace,",
            "text": "Enemies in the battlefield have -5 to their Physical Strength. Allies cannot be provoked or confused after being healed by Eirene. Heals all allies for 15 HP at the end of every 2 turns automatically."
        },
        "abilities": [
            {
                "id": "EIRENE_AB1",
                "name": "Soothing Light",
                "power": 8,
                "type": "physical",
                "text": "Effect: Heals 20 HP and removes one negative condition, if ally has no negative condition, heals 35 instead."
            },
            {
                "id": "EIRENE_AB2",
                "name": "Truce Ward",
                "power": 13,
                "type": "physical",
                "text": "Effect: One ally gains +8 Defense for 2 turns and becomes immune to magical damage during that time."
            },
            {
                "id": "EIRENE_AB3",
                "name": "Dove’s Grace",
                "power": 17,
                "type": "physical",
                "text": "Effect: All allies recover 20 HP and gain +5 Magical Power for the next turn."
            }
        ]
    },
    {
        "id": "HESTIA",
        "name": "Hestia",
        "canFly": false,
        "stats": {
            "HP": 140,
            "STR": 6,
            "MAG": 18,
            "WIS": 19
        },
        "passive": {
            "name": "Hearthguard",
            "text": "Allies who begin their turn within 2 meters of Hestia gain +3 Defense. Hestia cannot be knocked back or forcibly moved. Once per ally, if an ally drops to 0 HP, she may restore them to 50 HP instantly."
        },
        "abilities": [
            {
                "id": "HESTIA_AB1",
                "name": "Ember Shield",
                "power": 9,
                "type": "physical",
                "text": "Effect: Target gains +4 Defense for 2 turns and reflects 3 damage to melee attackers."
            },
            {
                "id": "HESTIA_AB2",
                "name": "Flame of Resolve",
                "power": 13,
                "type": "physical",
                "text": "Effect: All allies within range gain +3 Physical Strength and +2 Wisdom for 1 round."
            },
            {
                "id": "HESTIA_AB3",
                "name": "Sanctuary Blaze",
                "power": 17,
                "type": "physical",
                "text": "Effect: Allies in the area cannot be affected by negative spells for 1 round and recover 10 HP."
            }
        ]
    },
    {
        "id": "PANDORA",
        "name": "Pandora",
        "canFly": false,
        "stats": {
            "HP": 125,
            "STR": 7,
            "MAG": 19,
            "WIS": 15
        },
        "passive": {
            "name": "Echoes of the Box",
            "text": "At the start of every third round, one random enemy suffers a debuff: -2 to either Strength, Wisdom, or Magic Power for 1 round. Pandora may reroll one ability per game if the result is too chaotic—once per battle."
        },
        "abilities": [
            {
                "id": "PANDORA_AB1",
                "name": "Curse of Curiosity",
                "power": 10,
                "type": "physical",
                "text": "Effect: Target must skip their next attack or choose to take -4 Defense for 2 turns."
            },
            {
                "id": "PANDORA_AB2",
                "name": "Plagues and Sorrows",
                "power": 14,
                "type": "physical",
                "text": "Effect: Two enemies in range suffer -3 to Magical Power and take 5 damage for 2 rounds."
            },
            {
                "id": "PANDORA_AB3",
                "name": "Hope Unleashed",
                "power": 18,
                "type": "physical",
                "text": "Effect: All allies gain +4 Wisdom and +2 Defense for 2 turns. Additionally, revive one KO’d ally with 10 HP (usable once per game)."
            }
        ]
    },
    {
        "id": "HADES",
        "name": "Hades",
        "canFly": false,
        "stats": {
            "HP": 145,
            "STR": 10,
            "MAG": 20,
            "WIS": 18
        },
        "passive": {
            "name": "Lord of the Dead",
            "text": "Immune to instant-death, fear, or sleep effects. Once per game, if Hades drops to 0 HP, he remains conscious at 1 HP for 1 more round. Undead or ghost-type enemies do not attack him unless provoked."
        },
        "abilities": [
            {
                "id": "HADES_AB1",
                "name": "Soul Bind",
                "power": 12,
                "type": "physical",
                "text": "Effect: Enemy takes 10 damage and cannot heal next round."
            },
            {
                "id": "HADES_AB2",
                "name": "Underworld Grasp",
                "power": 16,
                "type": "physical",
                "text": "Effect: Up to 2 enemies lose their movement and suffer -4 to Physical Strength for 2 turns."
            },
            {
                "id": "HADES_AB3",
                "name": "Revamped Second Move: Shadowmist of the Helm",
                "power": 6,
                "type": "magical",
                "text": "Hades equips the Helm of Invisibility made by the Cyclopses. Once he enters the Invisible state, he is immune to single target physical attacks. He takes off his helmet after one turn and does 6 damage to all nearby enemies where he removes his helm. Enemies also suffer a -2 to their next attack roll. He cannot use it for another 3 turns."
            },
            {
                "id": "HADES_AB4",
                "name": "Black Riches",
                "power": 20,
                "type": "physical",
                "text": "Effect: All enemies in a radius take 5 damage and lose 2HP for the next turn."
            }
        ]
    },
    {
        "id": "CLYTEMNESTRA",
        "name": "Clytemnestra",
        "canFly": false,
        "stats": {
            "HP": 120,
            "STR": 17,
            "MAG": 6,
            "WIS": 16
        },
        "passive": {
            "name": "Queen’s Trap",
            "text": "Gains +3 Strength when attacking an enemy who is distracted, surprised, or has lower HP. First attack in every encounter gains +5 bonus damage if undetected or unchallenged. Immune to mind tricks or charm effects."
        },
        "abilities": [
            {
                "id": "CLYTEMNESTRA_AB1",
                "name": "Poisoned Blade",
                "power": 11,
                "type": "physical",
                "text": "Effect: Deals 11 damage + 2 more every turn for the next 2 turns."
            },
            {
                "id": "CLYTEMNESTRA_AB2",
                "name": "Widow’s Wrath",
                "power": 15,
                "type": "physical",
                "text": "Effect: Single enemy takes 15 damage and suffers -3 Defense for 1 round."
            },
            {
                "id": "CLYTEMNESTRA_AB3",
                "name": "Blood Oath",
                "power": 18,
                "type": "physical",
                "text": "Effect: Deal 10 damage to up to 2 enemies. If an enemy is under 30 HP, this becomes a critical hit (20 damage each)."
            }
        ]
    },
    {
        "id": "DEMETER",
        "name": "Demeter",
        "canFly": false,
        "stats": {
            "HP": 140,
            "STR": 12,
            "MAG": 17,
            "WIS": 19
        },
        "passive": {
            "name": "Fertile Ground",
            "text": "Allies near Demeter regenerate 3 HP at the start of every round. Terrain effects (mud, vines, roots) summoned by Demeter last 1 extra round. Immune to hunger, poison, and cold-based attacks."
        },
        "abilities": [
            {
                "id": "DEMETER_AB1",
                "name": "Rootbind",
                "power": 10,
                "type": "physical",
                "text": "Effect: Enemy loses next movement; -2 Physical Strength for 1 round."
            },
            {
                "id": "DEMETER_AB2",
                "name": "Autumn Shield",
                "power": 12,
                "type": "physical",
                "text": "Effect: Target gains +5 Defense for 2 rounds and recovers 10 HP."
            },
            {
                "id": "DEMETER_AB3",
                "name": "Harvest Wrath",
                "power": 18,
                "type": "physical",
                "text": "Effect: All enemies in a wide area take 12 damage and have a 50% chance to lose their next action due to choking vines or falling grain."
            }
        ]
    },
    {
        "id": "HEPHAESTUS",
        "name": "Hephaestus",
        "canFly": false,
        "stats": {
            "HP": 145,
            "STR": 18,
            "MAG": 10,
            "WIS": 15
        },
        "passive": {
            "name": "Forged Resilience",
            "text": "Takes -3 damage from all physical attacks. Immune to fire-based damage. May repair or reinforce weapons and armor mid-battle (once per encounter, restore +4 Defense or +5 Strength to an ally for 2 rounds)."
        },
        "abilities": [
            {
                "id": "HEPHAESTUS_AB1",
                "name": "Flame Hammer",
                "power": 12,
                "type": "physical",
                "text": "Effect: Deals 12 damage and causes the target’s defense to drop by 2 next round."
            },
            {
                "id": "HEPHAESTUS_AB2",
                "name": "Molten Trap",
                "power": 10,
                "type": "physical",
                "text": "Effect: Area effect—enemies caught must skip their movement next turn or take 6 extra burn damage."
            },
            {
                "id": "HEPHAESTUS_AB3",
                "name": "Unbreakable Anvil",
                "power": 16,
                "type": "physical",
                "text": "Effect: He gains +4 Defense for 2 rounds; all allies within range gain +2 Physical Strength temporarily."
            }
        ]
    },
    {
        "id": "PAN",
        "name": "Pan",
        "canFly": true,
        "stats": {
            "HP": 120,
            "STR": 11,
            "MAG": 17,
            "WIS": 15
        },
        "passive": {
            "name": "Aura of the Wild",
            "text": "Enemies nearby (within 3 meters) must roll twice when attacking—take lower result. Pan is unaffected by terrain penalties (roots, mud, vines). Musical attacks cannot be silenced or reflected."
        },
        "abilities": [
            {
                "id": "PAN_AB1",
                "name": "Dread Pipe",
                "power": 10,
                "type": "physical",
                "text": "Effect: Target must skip next attack or take a -3 penalty to all rolls next round."
            },
            {
                "id": "PAN_AB2",
                "name": "Forest Surge",
                "power": 12,
                "type": "magical",
                "text": "Effect: Area effect—movement is disabled for 1 round; magical attacks reduced by 2."
            },
            {
                "id": "PAN_AB3",
                "name": "Frenzied Dance",
                "power": 16,
                "type": "physical",
                "text": "Effect: All enemies within range are confused—randomly attack or defend wrong target on next turn. Allies gain +2 to defense briefly."
            }
        ]
    },
    {
        "id": "GAEA",
        "name": "Gaea",
        "canFly": false,
        "stats": {
            "HP": 150,
            "STR": 14,
            "MAG": 19,
            "WIS": 18
        },
        "passive": {
            "name": "Mother of All",
            "text": "Gaea restores +5 HP at the end of every turn. Allies near Gaea gain +2 to Defense while standing on natural terrain. Immune to poison, paralysis, and terrain-based effects."
        },
        "abilities": [
            {
                "id": "GAEA_AB1",
                "name": "Tremor Pulse",
                "power": 12,
                "type": "physical",
                "text": "Effect: All enemies in contact with the ground lose their next movement and take -2 Defense for one round."
            },
            {
                "id": "GAEA_AB2",
                "name": "Verdant Surge",
                "power": 10,
                "type": "magical",
                "text": "Effect: Restore 15 HP to one ally and raise their Defense by 3 for 2 rounds."
            },
            {
                "id": "GAEA_AB3",
                "name": "Wrath of the Deep Earth",
                "power": 20,
                "type": "physical",
                "text": "Effect: Massive area damage. All grounded enemies take 20 damage and are stunned for 1 turn. Can only be used once per challenge."
            }
        ]
    },
    {
        "id": "CALYPSO",
        "name": "Calypso",
        "canFly": false,
        "stats": {
            "HP": 115,
            "STR": 6,
            "MAG": 19,
            "WIS": 17
        },
        "passive": {
            "name": "Island of Stillness",
            "text": "Once per challenge, Calypso may prevent one enemy from acting for 1 full turn (\"enchanted sleep\"). Enemy magical attacks near Calypso are reduced by -2 due to her time-slowing aura. Immune to charm or seduction-based effects."
        },
        "abilities": [
            {
                "id": "CALYPSO_AB1",
                "name": "Enchanted Longing",
                "power": 9,
                "type": "physical",
                "text": "Effect: Target suffers -3 to all rolls for 2 rounds; if they try to attack Calypso, they must reroll and take the lower result."
            },
            {
                "id": "CALYPSO_AB2",
                "name": "Temporal Drift",
                "power": 13,
                "type": "physical",
                "text": "Effect: Enemies in range lose their next movement or magical action. Allies gain +2 to defense during the slowed round."
            },
            {
                "id": "CALYPSO_AB3",
                "name": "Binding Song of Ogygia",
                "power": 18,
                "type": "physical",
                "text": "Effect: All enemies must roll Wisdom. On failure, they are stunned and skip their next turn. Calypso gains +5 HP for each affected target."
            }
        ]
    },
    {
        "id": "IRIS",
        "name": "Iris",
        "canFly": true,
        "stats": {
            "HP": 120,
            "STR": 8,
            "MAG": 19,
            "WIS": 18
        },
        "passive": {
            "name": "Rainbow Flight",
            "text": "Sets a weather effect (Rainbow) where all allies get +2 to their movement roll for 3 rounds, once per challenge. May move twice per turn once per challenge. Allies receive +2 to Wisdom-based rolls when within 2 meters of Iris due to clarity of communication."
        },
        "abilities": [
            {
                "id": "IRIS_AB1",
                "name": "Prism Strike",
                "power": 11,
                "type": "physical",
                "text": "Effect: Deals magical damage and causes -2 accuracy to the enemy on their next action."
            },
            {
                "id": "IRIS_AB2",
                "name": "Message of the Gods",
                "power": 0,
                "type": "physical",
                "text": "Effect: Heals an ally for 2 HP every round for 4 rounds."
            },
            {
                "id": "IRIS_AB3",
                "name": "Arc of Illumination",
                "power": 16,
                "type": "physical",
                "text": "Effect: Heals 15 HP for all allies and blinds enemies for one round (they must reroll and take lower result on next action)."
            }
        ]
    },
    {
        "id": "CRONUS",
        "name": "Cronus",
        "canFly": false,
        "stats": {
            "HP": 135,
            "STR": 18,
            "MAG": 12,
            "WIS": 14
        },
        "passive": {
            "name": "Titan’s Chance",
            "text": "Every turn Cronus gets 2 coinflip(If the allies end he will get 1 coinflip if the enemies end he will get 1 coin flip) If the coin flip lands on heads, gives 1 stack to his abilities/passive The stacks can be used to his abilities and passive If Cronus gets attacked and if the user chooses to, it will deflect or bring back time to damage the attacker itself. Passive can be used to turn back time if 2 stacks or more are in his hands. Sickle Slash -> Mass infection of the titans ==(power 10) i. Deals 10 dmg to an enemy and creates a reaction that bounces the dmg to all enemies by Ii. Gets 1-2 stacks depending on the enemies hp. If Cronus attacks a x>75 enemy Gets a stack If Cronus attacks a x<75 enemy Gets 2 stacks iii . Gets NO STACKS if the enemy’s hp is below 35. 4. Temporal Rewind -> Wrath of Time == (power 0) Undos the action if the stacks of his passive are 2-3 stacks and adds a “Glitched of time” - which grants the attacker(depending on his defence) -5 hp. Uses -10hp to Cronus 5.Age of Ruin -> Wrath of the Titans(depending on the dice) If Cronus has 5-7 stacks of his passive he can use the ultimate If Cronus has 5 stacks of his passive, deals -12 dmg(Ignores the enemies defense) in 2 rounds If Cronus has 6 stacks of his passive, deals -15dmg(Ignores the enemies defense) in 2 rounds If Cronus has 7 or more stacks of his passive, deals -19dmg(Ignores the enemies defence) in 3 rounds. If Cronus uses his ultimate adds 55 hp to his hp and eliminates all debuff from cronus stacks to his hp"
        },
        "abilities": [
            {
                "id": "CRONUS_AB1",
                "name": "Sickle Slash",
                "power": 10,
                "type": "physical",
                "text": "Effect: Bypasses 3 points of enemy defense."
            },
            {
                "id": "CRONUS_AB2",
                "name": "Temporal Rewind",
                "power": 0,
                "type": "physical",
                "text": "Effect: Once per game, Cronus may undo the last action against him (including damage or debuff)."
            },
            {
                "id": "CRONUS_AB3",
                "name": "Age of Ruin",
                "power": 19,
                "type": "physical",
                "text": "Effect: All enemies in range suffer -4 to defense for 2 rounds and take 10 damage. Magical power -> 17, Wisdom -> 12 Physical Strength -> 20 Health -> 100"
            }
        ]
    },
    {
        "id": "KRATOS",
        "name": "Kratos",
        "canFly": false,
        "stats": {
            "HP": 140,
            "STR": 20,
            "MAG": 4,
            "WIS": 10
        },
        "passive": {
            "name": "Relentless Force",
            "text": "Gains +2 bonus damage if he attacked the same enemy last turn. Immune to being stunned, silenced, or knocked back. Can break objects or physical barriers others cannot."
        },
        "abilities": [
            {
                "id": "KRATOS_AB1",
                "name": "Brutal Slam",
                "power": 11,
                "type": "physical",
                "text": "Effect: Knocks target to the ground (they lose next action unless they roll above 12)."
            },
            {
                "id": "KRATOS_AB2",
                "name": "Iron Grip",
                "power": 6,
                "type": "physical",
                "text": "Effect: Prevents enemy movement for 1 round and deals minor damage."
            },
            {
                "id": "KRATOS_AB3",
                "name": "Unyielding Onslaught",
                "power": 20,
                "type": "physical",
                "text": "Effect: Deals 20 damage to a single enemy. If that enemy is defeated, Kratos may immediately move and strike a second target for 10 damage."
            }
        ]
    },
    {
        "id": "HYACINTH",
        "name": "Hyacinth",
        "canFly": false,
        "stats": {
            "HP": 120,
            "STR": 6,
            "MAG": 16,
            "WIS": 17
        },
        "passive": {
            "name": "Bloom from Grief",
            "text": "Whenever a teammate is defeated, Hyacinth restores 10 HP to all remaining allies. Once per battle, can revive a fallen ally to 20 HP (usable only if Hyacinth is still standing). Immune to poison or nature-based attacks."
        },
        "abilities": [
            {
                "id": "HYACINTH_AB1",
                "name": "Petal Surge",
                "power": 8,
                "type": "magical",
                "text": "Effect: Reduces enemy Defense by 2 for 1 round."
            },
            {
                "id": "HYACINTH_AB2",
                "name": "Spring’s Grace",
                "power": 0,
                "type": "physical",
                "text": "Effect: Restores 15 HP to an ally. If the ally is under 30 HP, healing increases to 20."
            },
            {
                "id": "HYACINTH_AB3",
                "name": "Floral Tempest",
                "power": 18,
                "type": "physical",
                "text": "Effect: All enemies in range take 10 damage and suffer -2 to their next magical attack or defense roll."
            }
        ]
    },
    {
        "id": "PEITHO",
        "name": "Peitho",
        "canFly": true,
        "stats": {
            "HP": 115,
            "STR": 5,
            "MAG": 19,
            "WIS": 16
        },
        "passive": {
            "name": "Velvet Chains",
            "text": "Once per battle, Peitho can delay any enemy’s action until the end of the round. Enemies under a magical status effect (e.g., stunned, silenced, confused) take +2 extra damage from all sources while Peitho is in play. Immune to magical mind-control effects herself."
        },
        "abilities": [
            {
                "id": "PEITHO_AB1",
                "name": "Bewildering Gaze",
                "power": 9,
                "type": "physical",
                "text": "Effect: Target must skip their next special (magical or passive) ability."
            },
            {
                "id": "PEITHO_AB2",
                "name": "Binding Words",
                "power": 7,
                "type": "physical",
                "text": "Effect: Target’s next attack deals half damage."
            },
            {
                "id": "PEITHO_AB3",
                "name": "Web of Influence",
                "power": 18,
                "type": "physical",
                "text": "Effect: Up to 3 enemies lose their next movement or position-related action. If flying, they must land next turn or take 5 damage."
            }
        ]
    },
    {
        "id": "AGAMEMNON",
        "name": "Agamemnon",
        "canFly": false,
        "stats": {
            "HP": 135,
            "STR": 17,
            "MAG": 5,
            "WIS": 14
        },
        "passive": {
            "name": "Royal Defiance",
            "text": "When Agamemnon is attacked, the attacker suffers 2 damage automatically. Gains +3 defense during the first round of battle. Immune to intimidation-based effects."
        },
        "abilities": [
            {
                "id": "AGAMEMNON_AB1",
                "name": "Crushing Verdict",
                "power": 10,
                "type": "physical",
                "text": "Effect: Target loses 2 defense for the next 2 turns."
            },
            {
                "id": "AGAMEMNON_AB2",
                "name": "Battle Retaliation",
                "power": 7,
                "type": "physical",
                "text": "Effect: Instantly counters with a blow that deals 7 damage. May only be used once per round."
            },
            {
                "id": "AGAMEMNON_AB3",
                "name": "King’s Wrath",
                "power": 18,
                "type": "physical",
                "text": "Effect: Deals 18 damage to an enemy who has attacked Agamemnon this round. If not applicable, damage is reduced to 10."
            }
        ]
    },
    {
        "id": "AGAMEMNON",
        "name": "Agamemnon",
        "canFly": false,
        "stats": {
            "HP": 135,
            "STR": 17,
            "MAG": 5,
            "WIS": 14
        },
        "passive": {
            "name": "Royal Defiance",
            "text": "When Agamemnon, or any of his allies are attacked, 25% of the damage is reflected back towards the attacker Funny Serious Leader Comedian, gives a joke every round and boosts allies with a +1 atk) Also, if the ally is dead, he or she will laugh in the underworld and be motivated by Agamemnon’s beautiful joke/speech. Immune to intimidation-based effects."
        },
        "abilities": [
            {
                "id": "AGAMEMNON_AB1",
                "name": "MY SOLDIERS RAGE!!!",
                "power": 10,
                "type": "physical",
                "text": "Effect: Target loses 2 defense for the next 2 turns and boosts allies' attack because they see a whole army rushing a god/goddess while screaming. Voicelines: COME ON LETS GO! ADVANCE!!! MEN, WITH MEEEE!! MY SOLDIERS RAGE!!!"
            },
            {
                "id": "AGAMEMNON_AB2",
                "name": "Shield and Spear of the Trojan horse (AOE)",
                "power": 0,
                "type": "physical",
                "text": "Puts a shield on any ally depending on the user. If that shield is attacked, it deflects 75% of the damage from the attacker and 25% to all enemies. This shield can only be placed one ally per round. This shield breaks after one attack IF the enemy is not marked. Agamemnon can place a mark on any enemy. If that marked enemy attacks the shielded ally, the shield will not break. Also, only Sir Da can know who I shielded so the enemy won’t know who is shielded and who is marked. A gamble for the enemies to choose. Voicelines YOU WILL NOT KILL MY ALLIES!!"
            },
            {
                "id": "AGAMEMNON_AB3",
                "name": "HERE COMES THE TROJAN HORSE!",
                "power": 22,
                "type": "physical",
                "text": "Voicelines: HERE COMES THE PARTY!! GO AHEAD, STAND YOUR GROUND I SUGGEST YOU MOVE!! LETS GOOO!!!"
            }
        ]
    },
    {
        "id": "ATHENA",
        "name": "Athena",
        "canFly": false,
        "stats": {
            "HP": 130,
            "STR": 12,
            "MAG": 18,
            "WIS": 20
        },
        "passive": {
            "name": "Aegis Insight",
            "text": "Gains +2 defense against magical or wisdom-based attacks. Once per battle, may nullify an incoming magical attack completely. Allies within range gain +1 to defense when defending near Athena."
        },
        "abilities": [
            {
                "id": "ATHENA_AB1",
                "name": "Spear of Precision",
                "power": 10,
                "type": "physical",
                "text": "Effect: Ignores enemy defense if their magical power is lower than 10."
            },
            {
                "id": "ATHENA_AB2",
                "name": "Shield Ward",
                "power": 0,
                "type": "physical",
                "text": "Effect: Grants one ally +5 defense for one turn OR reduces incoming damage by 10."
            },
            {
                "id": "ATHENA_AB3",
                "name": "Owl’s Command",
                "power": 17,
                "type": "physical",
                "text": "Effect: All enemies in range must reroll their next action; use the lower result."
            }
        ]
    },
    {
        "id": "AEACUS",
        "name": "Aeacus",
        "canFly": false,
        "stats": {
            "HP": 130,
            "STR": 14,
            "MAG": 20,
            "WIS": 18
        },
        "passive": {
            "name": "Courtroom of the Damned",
            "text": "At the start of combat, Aeacus marks one random enemy as “In Trial.” Aeacus automatically senses deceit or illusion-based abilities. This makes enemies “In Trial” reveal their ultimate/strongest ability. Enemies who break an agreement or truce while “In Trial” (within team challenge rules) receive 5 damage instantly. Immune to confusion or mind-altering effects."
        },
        "abilities": [
            {
                "id": "AEACUS_AB1",
                "name": "(1st Skill) Gavel Strike",
                "power": 12,
                "type": "physical",
                "text": "Effect: If the enemy used a deceitful or sneaky move last turn, this attack deals +3 bonus damage."
            },
            {
                "id": "AEACUS_AB2",
                "name": "(2nd Skill) Verdict of Truth",
                "power": 0,
                "type": "physical",
                "text": "Effect: You or an ally gain advantage (choose better result) when countering."
            },
            {
                "id": "AEACUS_AB3",
                "name": "(Ultimate) Deadly Sentencing",
                "power": 25,
                "type": "physical",
                "text": "The gavel falls. The sentence is death.” Automatically hits an enemy “In Trial” Effect: Deals 25 magic damage (20 if enemy is physical-based) If the target has broken a rule/deceived, damage increases by 5. Voice Lines When marking an enemy:“Your sins have been weighed. Now, face their reckoning..” When using 1st Skill: “Silence in the court!” When using 2nd Skill: “Reveal your next act; perjury carries a steep price.” When using Ultimate: “Guilty. Sentence: Execution.” Victory: “Justice is served.”"
            }
        ]
    },
    {
        "id": "PROMETHEUS",
        "name": "Prometheus",
        "canFly": false,
        "stats": {
            "HP": 125,
            "STR": 10,
            "MAG": 18,
            "WIS": 20
        },
        "passive": {
            "name": "Flame of Insight",
            "text": "Prometheus may see one enemy’s next move once per team challenge. Automatically resists fire-based attacks (takes half damage). Whenever an ally makes a mistake in logic/puzzle tasks, Prometheus can grant them a retry (once per challenge)."
        },
        "abilities": [
            {
                "id": "PROMETHEUS_AB1",
                "name": "Firebrand Spark",
                "power": 9,
                "type": "physical",
                "text": "Effect: Burns the target lightly—lowers their magic power by 2 next turn."
            },
            {
                "id": "PROMETHEUS_AB2",
                "name": "Wrath of the Torch",
                "power": 14,
                "type": "physical",
                "text": "Effect: If the enemy is a god or authority figure, deal +3 bonus damage."
            },
            {
                "id": "PROMETHEUS_AB3",
                "name": "Chainbreaker Flame",
                "power": 17,
                "type": "physical",
                "text": "Effect: All allies remove debuffs or negative status effects. Enemies with control/debuff powers take 5 additional damage."
            }
        ]
    },
    {
        "id": "DAEDALUS",
        "name": "Daedalus",
        "canFly": false,
        "stats": {
            "HP": 120,
            "STR": 8,
            "MAG": 16,
            "WIS": 19
        },
        "passive": {
            "name": "Depths of a Genuis’ Mind",
            "text": "Special Effect: If in the same team as Icarus, +1 Wisdom and a 50% chance to be considered as flying (skills that can’t affect flying enemies have a 50% chance to not affect Daedalus). Daedalus gains automatic advantage (choose better outcome) on any puzzle or construction-based challenge. Can create one temporary gadget or tool per game session (teacher discretion). Traps and obstacles created by enemies have a 70% chance of failing when targeting Daedalus (chance reduces by 6% after every successful trigger, to a minimum of 40%)."
        },
        "abilities": [
            {
                "id": "DAEDALUS_AB1",
                "name": "Gearshock",
                "power": 8,
                "type": "physical",
                "text": "Finally, I found exactly what this new invention of mine needs..!”\n Hurls a mechanical gadget that explodes in electric pulses. Effect: May disable one magical effect for 1 round (roll to confirm success)."
            },
            {
                "id": "DAEDALUS_AB2",
                "name": "Twists & Turns",
                "power": 12,
                "type": "physical",
                "text": "This labyrinth of mine holds many secrets… A shame you won’t get to see all of them.” Daedalus deploys a trap in the path of an enemy. Has different effects depending on the player’s choice. Variant 1: Enemy loses next turn if they are grounded. No effect on flying enemies. Variant 2: If the targeted enemy is flying, ground them for this turn. If the targeted enemy was already grounded, deal half damage and give all allies 1 dice roll to remove all debuffs for this turn and next turn."
            },
            {
                "id": "DAEDALUS_AB3",
                "name": "Inventor's Salvation",
                "power": 16,
                "type": "physical",
                "text": "Now’s our chance, Ικαρος! Our chance to get out of this wretched tower…”\nActivates a mechanical shield around himself and a selected ally. Effect: Blocks next physical or magical attack completely. Can only be used once at full effectiveness. After the first use, it turns into an 80% damage reduction for both Daedalus and the targeted ally, weakening by 10% after every subsequent use (up to a minimum of 30%). When used on Icarus: Functions as if it was used for the first time (fully blocks next attack), and prevents Icarus from Overheating next turn. Has a cooldown of 2 turns, starting after use."
            }
        ]
    },
    {
        "id": "HECATE",
        "name": "Hecate",
        "canFly": true,
        "stats": {
            "HP": 115,
            "STR": 5,
            "MAG": 20,
            "WIS": 19
        },
        "passive": {
            "name": "Triple Sight",
            "text": "Immune to illusion-based attacks and deception. Can see hidden or invisible characters. Once per game, Hecate may undo the last magical effect (teacher decides if valid)."
        },
        "abilities": [
            {
                "id": "HECATE_AB1",
                "name": "Witchfire Orb",
                "power": 10,
                "type": "physical",
                "text": "Effect: Causes magic damage and weakens the target’s magical power by 3 for one round."
            },
            {
                "id": "HECATE_AB2",
                "name": "Crossroads Curse",
                "power": 14,
                "type": "physical",
                "text": "Effect: Enemy must roll twice next turn and follow the worse outcome."
            },
            {
                "id": "HECATE_AB3",
                "name": "Veil of Shadows",
                "power": 18,
                "type": "physical",
                "text": "Effect: All allies gain +4 defense for 1 round. Enemies cannot use high-accuracy attacks."
            }
        ]
    },
    {
        "id": "ACHILLES",
        "name": "Achilles",
        "canFly": false,
        "stats": {
            "HP": 145,
            "STR": 20,
            "MAG": 2,
            "WIS": 10
        },
        "passive": {
            "name": "Heel of Fate",
            "text": "Achilles is immune to physical attacks under 12 power. Takes half damage from magical attacks When hit by a high-damage attack (physical and magical) (15+ Power), Achilles triggers Heroic Strike as a reactive action (does not consume my turn) Once per challenge, if struck at his Heel, Achilles loses all resistances for 1 round Enemies must specify which heel; only one heel is vulnerable. At battle start, Achilles chooses one Bonded Ally () Bonded Ally is shielded while Achilles is on the field (+20 temporary HP every other turn) If that ally is defeated, Achilles enters Rage of Loss: All attacks deal +5 damage (permanent) Immediately takes 1 bonus action"
        },
        "abilities": [
            {
                "id": "ACHILLES_AB1",
                "name": "Spear of Peleus",
                "power": 15,
                "type": "physical",
                "text": "Effect: If target used an high-damage attack (15+ Power) last turn (same trigger as passive), Heroic Strike deals +5 bonus damage"
            },
            {
                "id": "ACHILLES_AB2",
                "name": "Shield Bash",
                "power": 15,
                "type": "physical",
                "text": "Effect: Stuns the target (they lose their next basic action). Effect: Grants Achilles and his Bonded Ally +20 Shield HP (absorbs incoming damage then vanishes after 1 turn). Bonus: If the enemy’s last attack was 15+ Power, increase Shield HP by 15."
            },
            {
                "id": "ACHILLES_AB3",
                "name": "Wrath of Achaeans",
                "power": 0,
                "type": "physical",
                "text": "Effect: Achilles gains an extra action each turn. Effect: All attacks deal +20 bonus damage. Effect: When Achilles kills an enemy, he heals +20 HP. Effect: Allies gain +10 bonus damage on their next attack (battle cry effect). Special: If Bonded Ally has fallen, Achilles gains 50 shield HP (temporary HP) per turn Special 2: If all allies have fallen, Achilles gains 150 shield HP (temporary HP) per turn and CC immunity"
            }
        ]
    },
    {
        "id": "MOROS",
        "name": "Moros",
        "canFly": false,
        "stats": {
            "HP": 115,
            "STR": 6,
            "MAG": 18,
            "WIS": 19
        },
        "passive": {
            "name": "Loom of Doom",
            "text": "Enemies affected by Moros’ spells cannot heal for 2 turns. Once per game, Moros can declare an enemy “Marked by Fate”: that enemy will take +5 damage from all sources for the rest of the challenge."
        },
        "abilities": [
            {
                "id": "MOROS_AB1",
                "name": "Wither Word",
                "power": 8,
                "type": "physical",
                "text": "Effect: Target loses their next magical bonus or buff."
            },
            {
                "id": "MOROS_AB2",
                "name": "Threads Unraveling",
                "power": 12,
                "type": "physical",
                "text": "Effect: Enemy must choose between missing their next turn or taking 10 direct damage."
            },
            {
                "id": "MOROS_AB3",
                "name": "Doomfall",
                "power": 20,
                "type": "physical",
                "text": "Effect: Damage spreads—each adjacent enemy takes 5 damage if clustered.\n Can only be used once per game."
            }
        ]
    },
    f{
        "id": "POSEIDON",
        "name": "Poseidon",
        "canFly": true,
        "stats": {
            "HP": 145,
            "STR": 18,
            "MAG": 18,
            "WIS": 13
        },
        "passive": {
            "name": "Sea",
            "text": "Earthshaker’s Authority Once per 2 rounds, Poseidon may cause the ground to tremble: all enemies lose movement and take 5 damage. For enemies that are flying; take 5 damage due to the shockwaves and are confused (-3 to all rolls in a round) Any battle in a water-based or stormy setting gives Poseidon +3 to all rolls. Once per battle: Poseidon may reroll and choose which roll to base off on for the turn sequence OLYMPIAN VITALITY Immune to water and wind-based attacks Regains +5 HP per 2 rounds 10% damage reduction when attacked by fire or lightning attacks STORMCALLER’S BLESSING Every 2 rounds, Poseidon may trigger rainfall to the battlefield If the battlefield is under rain or storm, Poseidon will receive + 5 HP buff."
        },
        "abilities": [
            {
                "id": "POSEIDON_AB1",
                "name": "Trident Crash",
                "power": 12,
                "type": "physical",
                "text": "Effect: If the enemy has less than 40 HP, they are knocked down and receive -2 on their accuracy. Effect: Choose two enemies to attack—the other will receive only 50% of the attack."
            },
            {
                "id": "POSEIDON_AB2",
                "name": "Sea Surge",
                "power": 10,
                "type": "magical",
                "text": "Effect: Deals 10 damage and forces non-flying enemies to move away, disrupting turn sequences. Effect: If there are no non-flying enemies, they will receive a -2 on their accuracy due to the disorienting aspect of the surge."
            },
            {
                "id": "POSEIDON_AB3",
                "name": "Tsunami of the Abyss",
                "power": 20,
                "type": "physical",
                "text": "Effect: All enemies take 10 damage and immobilize 2 enemies for 1 turn as tentacles bind them. Can only be used once per battle. Effect: If Poseidon rolls a 20, he gets to choose another enemy to immobilize. Special: If an enemy is immobilised and has less than 40 HP, they receive another 5 crushing damage from the tentacles tightening."
            }
        ]
    },
    {
        "id": "AERGIA",
        "name": "Aergia",
        "canFly": false,
        "stats": {
            "HP": 130,
            "STR": 6,
            "MAG": 15,
            "WIS": 14
        },
        "passive": {
            "name": "Aura of Sloth",
            "text": "At the start of her turn, Aergia may choose 2 opponents. That opponent loses their movement, action, and chance to activate their passive (too lazy to act). Can be used once every 4 turns. Sloth; Aergia cannot act every other round. When she feels lazy, she gains 10 HP for herself, if she is full HP, she gives -3 to enemy action and movement rolls."
        },
        "abilities": []
    }
]
